import numpy as np 
from matplotlib import pyplot as plt 
import collections


plt.title("Зависимость водопоглощения от количества ПСМ") 
plt.xlabel("Количество ПСМ (%, масса)") 
plt.ylabel("Водопоглощение (%, масса)") 


x = [1, 2, 4, 5, 6, 7, 8, 9, 11]
y1 = [ 0.1361, 0.1627, 0.2539, 0.2814, 0.3093, 0.3373, 0.3644, 0.4022, 0.4543]
y2 = [ 0.3521,
0.4132,
0.5571,
0.6405,
0.8003,
0.8372,
0.7502,
0.7529,
0.7543
]
y3 = [
     0.4334,
0.5503,
0.6109,
0.6539,
0.4941,
0.5100,
0.5487,
0.5543,
0.5597
]

y4 = [ 0.1934,
0.1762,
0.1671,
0.3214,
0.3173,
0.2202,
0.2431,
0.2654,
0.2701,
]

y5 = [ 0.2121,
0.2907,
0.3911,
0.3754,
0.4175,
0.4571,
0.4302,
0.4671,
0.5239
]

y6 = [ 0.4332,
0.6003,
0.7002,
0.7904,
0.6024,
0.5491,
0.6221,
0.5186,
0.5831
]
x1 = [ '0',
'10.3',
'14.75',
'18',
'28.3'
]

x2 = ['1','2','3','4','5']

Y = [y1, y2, y3, y4, y5, y6]
srs = []
for y in Y:
    if y != y2:
        srs.append(sum(y) / len(x))
print(srs)
print(x1)
plt.bar(x1, srs)
plt.plot(1, 1, 'wo')
plt.show()